Repository: Lonsdale201/Simple-Loyalty-Program
Catalog: languages/hw-woo-loyalty-*.po
Languages: hu_hu

source: Loyalty settings for WooCommerce
hu_hu: Törzsvásárlói funkciók a WooCommerce-hez

source: Loyalty Program
hu_hu: Törzsvásárló

source: Global Settings
hu_hu: Globális beállítások

source: Periodical Discount
hu_hu: Időszakos kedvezmény

source: Loyalty
hu_hu: Törzsvásárló

source: Messages
hu_hu: Üzenetek

source: Notifications
hu_hu: Értesítések

source: Settings that apply to both periodic discounts and loyalty program discounts.
hu_hu: Beállítások, amelyek mind az időszakos kedvezményekre, mind a törzsvásárlói kedvezményekre vonatkoznak.

source: Discount Name
hu_hu: Kedvezmény megnevezése

source: Loyalty Discount
hu_hu: Törzsvásárlói kedvezmény

source: Discount Mode
hu_hu: Kedvezmény módja

source: Choose the discount method.
hu_hu: Válaszd ki a kedvezmény módját.

source: Cart Based
hu_hu: Kosár alapú

source: Discount Amount Type
hu_hu: Kedvezmény Összegének Típusa

source: Cart-Based (%)
hu_hu: Kosár Alapú (%)

source: Cart-Based (Fixed Amount)
hu_hu: Kosár Alapú (Fix összegű)

source: Percentage Discount Amount
hu_hu: Százalékos kedvezmény mértéke

source: Discount as a percentage of the cart total.
hu_hu: A kosár teljes összegéből számított százalékos kedvezmény.

source: Fixed Discount Amount
hu_hu: Fix összegű kedvezmény mértéke

source: Fixed amount to be deducted from the cart total (does not include delivery charges). Enter the amount excluding tax.
hu_hu: A kosár végösszegéből levonandó fix összeg (nem tartalmazza a szállítási díjat). Add meg az adó nélküli összeget.

source: Exclude Settings
hu_hu: Kizárási beállítások

source: Settings that define conditions under which the loyalty discount will not be applied.
hu_hu: Olyan beállítások, amelyek meghatározzák azokat a feltételeket, amelyek mellett a hűségkedvezmény nem kerül alkalmazásra.

source: Exclude sale product
hu_hu: Akciós termékek kizárása

source: if you enable this and there is a sale item in the cart, no discount will be given
hu_hu: Ha engedélyezed ezt, és akciós termék van a kosárban, akkor nem jár a törzsvásárlói kedvezmény

source: Disable Coupon Usage
hu_hu: Kupon használatának tiltása

source: If enabled, coupons will be disabled when loyalty discounts are active.
hu_hu: Ha engedélyezve van, a kuponok le lesznek tiltva, amikor a törzsvásárlói kedvezmények aktívak a felhasználónál.

source: Periodic discount
hu_hu: Időszakos kedvezménx

source: Periodic discount settings based on the users spending amount and spending cycle.
hu_hu: Időszakos kedvezmény beállításai a felhasználók költési összege és költési ciklusa alapján.

source: Enable Periodic discount
hu_hu: Időszakos kedvezmény engedélyezése

source: Enable periodic discounts. If enabled, the <b>loyalty program will not be available!</b>
hu_hu: Engedélyezd az időszakos kedvezményeket. Ha engedélyezed, a <b>törzsvásárlói program nem lesz elérhető!</b>

source: Target Amount
hu_hu: Célösszeg

source: Minimum spending required, combined with the spending cycle, to determine discount eligibility.
hu_hu: Az időszakos kedvezményhez szükséges minimális költés az adott időszak figyelembevételével.

source: Discount Cycle
hu_hu: Időszak

source: Specify the time period to be considered retrospectively for discount eligibility.
hu_hu: Add meg azt az időszakot, amelyet visszamenőlegesen figyelembe kell venni a kedvezmény jogosultságához.

source: Loyality program settings
hu_hu: Törzsvásárlói beállítások

source: Enable Loyality Program
hu_hu: Törzsvásárló engedélyezése

source: if you enable this, users who meet the criteria will be enrolled in the loyalty program. The status is saved in the user data
hu_hu: Ha engedélyezed ezt, a feltételeknek megfelelő felhasználók bekerülnek a törzsvásárlói programba. Az állapotot a felhasználói adatok között tároljuk.

source: Conditions
hu_hu: Kondíciók

source: Set the conditions under which a user will qualify for the loyalty program. The discount amount is set in the global settings.
hu_hu: Állítsd be azokat a feltételeket, amelyek alapján a felhasználó jogosult lesz a törzsvásárlói programra. A kedvezmény mértéke a globális beállításoknál kell megadnod.

source: Minimum Spent Amount
hu_hu: Min elköltött összeg

source: The minimum amount a user must have spent to qualify for the permanent discount. These values are not calculated on the basis of the current count, but after the setting has been enabled. This data is also stored in the user data.
hu_hu: A minimális összeg, amit a felhasználónak el kell költenie ahhoz, hogy jogosult legyen az állandó kedvezményre. Ezek az értékek nem az aktuális adatok alapján kerülnek kiszámításra, hanem a beállítás engedélyezése után. Ez az adat a felhasználói adatok között kerül tárolásra.

source: Minimum Order Items
hu_hu: Min megvásárolt tétel

source: The minimum number of items a user must have ordered to qualify. These values are not calculated on the basis of the current count, but after the setting has been enabled. This data is also stored in the user data.
hu_hu: A minimális darabszám, amit a felhasználónak rendelnie kell ahhoz, hogy jogosult legyen. Ezek az értékek nem az aktuális darabszám alapján kerülnek kiszámításra, hanem a beállítás engedélyezése után. Ez az adat a felhasználói adatok között kerül tárolásra.

source: User Role Selector
hu_hu: Szerepkörök

source: Select the user roles that qualify for the loyalty program. Leave empty for no specific role requirement.
hu_hu: Válaszd ki azokat a felhasználói szerepköröket, amelyek jogosultak a törzsvásárlói programra. Hagyd üresen, ha nincs konkrét szerepkörkövetelmény.

source: No roles available
hu_hu: Nincs szerepkör kiválasztva

source: Select roles...
hu_hu: Szerepkör választása...

source: Condition Relation
hu_hu: Kapcsolat

source: Select whether both conditions (amount and items) must be met, or just one.
hu_hu: Válaszd ki, hogy mindhárom feltételnek (összeg, termékek száma és szerepkör) teljesülnie kell-e, vagy elegendő, ha csak az egyik feltétel teljesül.

source: Gift Products
hu_hu: Ajándék termékek

source: Honor your loyal customers by automatically adding free products to their purchase. The added product(s) will appear as a 0 FT item.
hu_hu: Tiszteld meg hűséges vásárlóidat azzal, hogy automatikusan ingyenes termékeket adsz a vásárlásukhoz. Az hozzáadott termék(ek) ingyenes tételként jelennek meg.

source: Free Gift Label
hu_hu: Ingyenes termék címke

source: Text to display under free gift products in the cart and checkout pages.
hu_hu: Szöveg, amely az ajándék termékek alatt jelenik meg a kosár és a pénztár oldalakon.

source: e.g., Gift product
hu_hu: pl:. Ajándék termék

source: Choose Gift Products
hu_hu: Válasszuk ki az ingyenes termék8eket)

source: Select products to add as gifts for loyal customers.
hu_hu: Válaszd ki azokat a termékeket, amelyeket ajándékként szeretnél hozzáadni a hűséges vásárlók számára.

source: Choose products
hu_hu: Termékek kiválasztása

source: Inactivity
hu_hu: Inaktivitás

source: Optionally set inactivity rules to remove users from the loyalty program.
hu_hu: Opcionálisan megadható inaktivitási szabályok, amelyek alapján a felhasználók automatikusan kikerülnek a törzsvásárlói programból.

source: Enable Inactivity
hu_hu: Inaktivitás engedélyezése

source: Enable this if you want users to be removed from the loyalty program after a period of inactivity.
hu_hu: Engedélyezd ezt, ha azt szeretnéd, hogy a felhasználók egy inaktivitási időszak után kikerüljenek a törzsvásárlói programból.

source: Inactivity Time
hu_hu: Inaktivitási időszak

source: Specify the inactivity period after which users will be removed from the loyalty program.
hu_hu: Add meg az inaktivitási időszakot, amely után a felhasználók kikerülnek a törzsvásárlói programból."

source: %d month
hu_hu: %s hónap

source: Reset User Data
hu_hu: Felhasználó adatok törlése

source: If enabled, user data for total spending and purchased items will also be reset when removed from the program.
hu_hu: Ha engedélyezed, a felhasználó teljes költése és vásárolt tételei is visszaállításra kerülnek, amikor kikerül a programból.

source: Custom messages for specific scenarios in the loyalty program.
hu_hu: Egyedi üzenetek a törzsvásárlói program különböző eseteihez.

source: If Coupon Usage Disabled
hu_hu: Ha a kupon használat tiltva van

source: Message shown when coupon usage is disabled for a loyalty customer.
hu_hu: Az üzenet, amely akkor jelenik meg, ha a kuponhasználat le van tiltva a törzsvásárló számára.

source: Enter message here...
hu_hu: Üzenet megadása...

source: If Free Gift Removed from Cart
hu_hu: Ha az ingyenes termék eltávolításra került a kosárból

source: Message shown when a free gift product is removed from the cart. Use the %product to show the removed product name(s). Supports HTML
hu_hu: Az üzenet, amely akkor jelenik meg, ha egy ajándék termék eltávolításra kerül a kosárból. Használhatod a %product helyettesítő kódot az eltávolított termék(ek) nevének megjelenítéséhez. Támogatja a HTML-t is.

source: Enable Notifications
hu_hu: Értesítések engedélyezése

source: Enable this to display notification messages on the cart and checkout pages.
hu_hu: Engedélyezd ezt, hogy értesítési üzenetek jelenjenek meg a kosár és a pénztár oldalon.

source: Loyalty Program Message
hu_hu: Törzsvásárlói Program Üzenet

source: Show a message if the user is a loyalty customer or if the user has a periodic discount in the cart and checkout pages. Support HTML and shortcodes
hu_hu: Mutass egy üzenetet, ha a felhasználó törzsvásárlói program tag, vagy ha időszakos kedvezmény van a kosarában vagy a pénztár oldalon. Támogatja a HTML-t és a shortcodeokat.

source: Logged Out User Message
hu_hu: Kijelentkezett felhasználó üzenete

source: Message displayed on the cart page to encourage non-logged-in users. Supports HTML and shortcodes.
hu_hu: Az üzenet, amely a kosár oldalon jelenik meg, hogy ösztönözze a nem bejelentkezett felhasználókat. Támogatja a HTML-t és a shortcode-okat.

source: Enter incentive message here...
hu_hu: Írd be ide az ösztönző üzenetet...

source: Myaccount Page
hu_hu: Fiókom oldal

source: Create a custom menu item on the My Account page where you can display details about the loyalty program, terms, and conditions. After created the menu, please <b>refresh the permalink settings</b>
hu_hu: Hozz létre egy egyedi menüpontot a Saját fiók oldalon, ahol megjelenítheted a törzsvásárlói program részleteit, feltételeit és szabályait. A menü létrehozása után kérlek, <b>frissítsd az állandó hivatkozás beállításokat</b>.

source: Enable Myaccount Menu
hu_hu: Fiókom oldal menü engedélyezése

source: Enable this to add a new menu item to the My Account page for loyalty program information.
hu_hu: Engedélyezd ezt, hogy új menüpontot adj hozzá a Saját fiók oldalhoz a törzsvásárlói program információinak megjelenítéséhez.

source: Menu Label
hu_hu: Menü cím

source: Enter the name for the loyalty menu item in the My Account page.
hu_hu: Add meg a törzsvásárlói menüpont nevét a Saját fiók oldalon.

source: Menu Content
hu_hu: menü tartalom

source: Content displayed under the loyalty menu item. Supports HTML, shortcodes. Use the smart codes, <code>{{ discount-amount }}</code>, or <code>{{ customer.loyality.status | status-true: 'Active' | status-false: 'Not active' }}</code>
hu_hu: Tartalom, amely a törzsvásárlói menüpont alatt jelenik meg. Támogatja a HTML-t és a shortcode-okat. Használhatod az okoskódokat, például: <code>{{ discount-amount }}</code>, vagy <code>{{ customer.loyality.status | status-true: 'Aktív' | status-false: 'Nem aktív' }}</code>.

source: Enter loyalty program details here...
hu_hu: Add meg itt a törzsvásárlói program részleteit...

source: FluentCRM Integration
hu_hu: FluentCRM Integráció

source: Configure FluentCRM settings to automatically add loyalty program members to specific lists.
hu_hu: Állítsd be a FluentCRM beállításait, hogy a törzsvásárlói program tagjai automatikusan hozzáadásra kerüljenek bizonyos listához.

source: List Removal
hu_hu: Lista eltávolító

source: Enable this option to automatically remove users from the selected FluentCRM list if they no longer qualify for the loyalty program.
hu_hu: Engedélyezd ezt az opciót, hogy a felhasználók automatikusan eltávolításra kerüljenek a kiválasztott FluentCRM listáról, ha már nem jogosultak a törzsvásárlói programra.

source: Subscriber List
hu_hu: Listák

source: Select the FluentCRM subscriber list where users will be added automatically. Leave blank if you don’t want to add them.
hu_hu: Válaszd ki azt a FluentCRM listát, ahová a felhasználók automatikusan hozzáadásra kerülnek. Hagyd üresen, ha nem szeretnéd őket hozzáadni.

source: None
hu_hu: Nincs megadva

source: Select a list...
hu_hu: Lista kiválasztása...

source: Coupons are not allowed when loyalty discounts are applied.
hu_hu: Kuponok nem használhatók, amikor törzsvásárlói kedvezmény van érvényben.

source: Free Gift
hu_hu: Ajándék

source: Coupon usage is disabled for loyalty customers.
hu_hu: A kuponhasználat le van tiltva a törzsvásárlók számára.

source: A free gift has been removed from your cart as it is no longer available.
hu_hu: Egy ajándéktermék el lett távolítva a kosaradból, mivel már nem elérhető.

source: No activity
hu_hu: Nincs aktivitás

source: Not set
hu_hu: Nincs megadva

source: No
hu_hu: Nem

source: Yes
hu_hu: Igen

source: Is this user a loyalty program member?
hu_hu: Ez a felhasználó tagja a törzsvásárlói programnak?

source: Total Order Items
hu_hu: Össz rendelési tétel

source: Total number of items ordered by the user.
hu_hu: A felhasználó által rendelt tételek teljes száma.

source: Total Spent Amount
hu_hu: Össz elköltött összeg

source: Total amount spent by the user.
hu_hu: A felhasználó által elköltött teljes összeg.

source: Last Activity Date
hu_hu: Utolsó aktivitási dátum

source: Date of the user's last order or activity.
hu_hu: A felhasználó utolsó rendelésének vagy tevékenységének dátuma.

source: Loyalty Program Joined Date
hu_hu: A törzsvásárlói programhoz való csatlakozás dátuma.

source: The date the user joined the loyalty program.
hu_hu: A dátum, amikor a felhasználó csatlakozott a törzsvásárlói programhoz.

source: Settings
hu_hu: Beállítások

source: This plugin requires WooCommerce %s or later. Please update WooCommerce.
hu_hu: A bővítményhez WooCommerce %s vagy újabb verzió szükséges. Kérlek, frissítsd a WooCommerce-t.

source: This plugin requires WordPress %s or later. Please update WordPress.
hu_hu: A bővítményhez WordPress %s vagy újabb verzió szükséges. Kérlek, frissítsd a WordPress-t.

source: This plugin requires PHP %s or later. Please update your PHP version.
hu_hu: A bővítményhez PHP %s vagy újabb verzió szükséges. Kérlek, frissítsd a PHP verziódat.
